/*******************************************************************************
    Copyright (C), 2004-2007, YOUNGSUN. Co., Ltd.

    File name : // 文件名

    Version   : 1.0

    Description : // 用于详细说明此程序文件完成的主要功能，与其他模块
                  // 或函数的接口，输出值、取值范围、含义及参数间的控
                  // 制、顺序、独立或依赖等关系

    Others:       // 其它内容的说明
 
*******************************************************************************/

#ifndef GUITK_H__
#define GUITK_H__
/*----------------------------------------------------------------------------
 *	Include
 *----------------------------------------------------------------------------*/
#include "widget.h"
#include "bgbmp.h"
#include "ctrlst.h"
#include "table.h"
#include "button.h"
#include "txtlabel.h"
#include "txtfield.h"
#include "txtchoice.h"
#include "txtarea.h"

/*----------------------------------------------------------------------------
 *	Enum & Macro 
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *	Global Function Prototype
 *----------------------------------------------------------------------------*/

/*************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 输入参数说明，包括每个参数的作
                  // 用、取值说明及参数间关系。
* Output:         // 对输出参数的说明。
* Return:         // 函数返回值的说明
* Others:         // 其它说明
*************************************************/

#endif //GUITK_H__




