/*******************************************************************************
    Copyright (C), 2004-2007, YOUNGSUN. Co., Ltd.

    File name : // 文件名

    Version   : 1.0

    Description : // 用于详细说明此程序文件完成的主要功能，与其他模块
                  // 或函数的接口，输出值、取值范围、含义及参数间的控
                  // 制、顺序、独立或依赖等关系

    Others:       // 其它内容的说明
 
*******************************************************************************/

#ifndef WIDGET_H__
#define WIDGET_H__
/*----------------------------------------------------------------------------
 *	Include
 *----------------------------------------------------------------------------*/
#include "bgbmp.h"
/*----------------------------------------------------------------------------
 *	Struct
 *----------------------------------------------------------------------------*/
 
/*----------------------------------------------------------------------------
 *	Enum & Macro
 *----------------------------------------------------------------------------*/
#define C_CLS					255	//transparence
#define C_BLACK					251
#define C_WHITE					1
#define C_TXTFIELE_FOCUS_LINE 253
#define	CIRCLE					15

typedef enum
{
  GUI_MSG_0,
  GUI_MSG_1,
  GUI_MSG_2,
  GUI_MSG_3,
  GUI_MSG_4,
  GUI_MSG_5,
  GUI_MSG_6,
  GUI_MSG_7,
  GUI_MSG_8,
  GUI_MSG_9,
  GUI_MSG_UP,
  GUI_MSG_DOWN,
  GUI_MSG_LEFT,
  GUI_MSG_RIGHT,
  GUI_MSG_OK,
  GUI_MSG_GETFOCUS,
  GUI_MSG_LOSEFOCUS,
  GUI_MSG_COUNT
}GUI_MSGType_e;
/*----------------------------------------------------------------------------
 *	Global Function Prototype
 *----------------------------------------------------------------------------*/

/*************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 输入参数说明，包括每个参数的作
                  // 用、取值说明及参数间关系。
* Output:         // 对输出参数的说明。
* Return:         // 函数返回值的说明
* Others:         // 其它说明
*************************************************/

#endif //WIDGET_H__




