/*******************************************************************************
    Copyright (C), 2004-2007, YOUNGSUN. Co., Ltd.

    File name : appys.h

    Description : appys模块的全局函数声明

    Others:

    History:   1. wwqing creat 2012-10-17


*******************************************************************************/
#ifndef	_APPYS_H_
#define	_APPYS_H_

/*----------------------------------------------------------------------------
 *	Include
 *----------------------------------------------------------------------------*/
#include "digitv.h"
#include "dtvgui.h"
#include "dtvav.h"

/*----------------------------------------------------------------------------
 *	Define
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *	Struct
 *----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------
 *	Global functions
 *----------------------------------------------------------------------------*/
 
/*****************************************************************************
  Date&Time    :    2009-04-24
  Author          :   xyan
  Function Name   : GetSystemDate
  Description     : 获得编译日期
  Input           : 日期字符串指针
  Outut           :  
  Calls           : 
  Called by       :
  Global Variables: 
  Others          : 
*****************************************************************************/ 
void GetSystemDate( char * pDate);

/*****************************************************************************
  Date&Time    :    2009-04-24
  Author          :   xyan
  Function Name   : GetSystemTime
  Description     : 获得编译时间
  Input           : 时间字符串指针
  Outut           :  
  Calls           : 
  Called by       :
  Global Variables: 
  Others          : 
*****************************************************************************/ 
void GetSystemTime( char *pTime);


/*****************************************************************************
  Date&Time 	  : 2011-11-17
  Author		  :  hli
  Function Name   : ChSrch_SearchProcessShow
  Description	  : 显示搜索中的信号质量、信号强度和搜索进度 
  Input 		  : 				  
  Outut 		  :    
  Calls 		  : 
  Called by 	  :
  Global Variables: 
  Others		  : 
*****************************************************************************/ 
void ChSrch_SearchProcessShow(ControlList_t *pstTmpList,int CompletePercent,int Loop,int number);

#endif
